alvin233/F407_uCOSIII_191021/Examples/ST/STM32F407VET6/OS3/computerw5500.c
				S0_1_State = 0;
			}	
		}
	}
}
/*******************************************************************************
 * Funtion : Socket_Connect
 * Description : make connection of selected socket;
 * Input : s, socket port to establish connection;
 * Output : None
 * Return : None
 * Others : None
*******************************************************************************/
unsigned char Socket_1_Connect(SOCKET s)
{
	OS_ERR  err;
	/* set socket work as TCP mode */
	Write_1_W5500_SOCK_1Byte(s,Sn_MR,MR_TCP);
	/* open socket port s */
	Write_1_W5500_SOCK_1Byte(s,Sn_CR,OPEN);
	/* delay 8ms */
	OSTimeDlyHMSM(0u, 0u, 0u, 8u,
					OS_OPT_TIME_HMSM_STRICT,
					&err);
	if(Read_1_W5500_SOCK_1Byte(s,Sn_SR)!=SOCK_INIT)
	{
		/* open socket failed, close socket */
		Write_1_W5500_SOCK_1Byte(s,Sn_CR,CLOSE);
		return FALSE;
	}
	/* establish socket connection state */
	Write_1_W5500_SOCK_1Byte(s,Sn_CR,CONNECT);
	return TRUE;
}
/*******************************************************************************
 * Funtion : Socket_Listen
 * Description : set the socket port as server waiting for connection
 * Input : s, socket port to wait connection;
 * Output : None
 * Return : TRUE, sucesss; FALSE, fail;
 * Others : when socket work as server mode, 
 * just call the function once to put W5500 working as server mdoe;
*******************************************************************************/
unsigned char Socket_1_Listen(SOCKET s)
{
	OS_ERR  err;
	/* set socket work as TCP mode */
	Write_1_W5500_SOCK_1Byte(s,Sn_MR,MR_TCP); 
	/* open socket */
	Write_1_W5500_SOCK_1Byte(s,Sn_CR,OPEN);	
	/* delay 5ms */
	OSTimeDlyHMSM(0u, 0u, 0u, 5u,
					OS_OPT_TIME_HMSM_STRICT,
					&err);
	if(Read_1_W5500_SOCK_1Byte(s,Sn_SR)!=SOCK_INIT)
	{
		/* open socket failed, close socket */
		Write_1_W5500_SOCK_1Byte(s,Sn_CR,CLOSE);
		return FALSE;
	}	
	/* set socket listen connection */
	Write_1_W5500_SOCK_1Byte(s,Sn_CR,LISTEN);	
	/* delay 5ms */
	OSTimeDlyHMSM(0u, 0u, 0u, 5u,
				OS_OPT_TIME_HMSM_STRICT,
				&err);
	if(Read_1_W5500_SOCK_1Byte(s,Sn_SR)!=SOCK_LISTEN)
	{
		/* setting failed, close socket */
		Write_1_W5500_SOCK_1Byte(s,Sn_CR,CLOSE);
		return FALSE;
	}
	return TRUE;
	/* wait socket interruption to ensure the socket connection */
	/* when using listen mode, no need seting destnation IP and port number */
}
/*******************************************************************************
 * Funtion : Socket_UDP
 * Description : set the selected socket port UDP mode
 * Input : s, socket port to wait connection;
 * Output : None
 * Return : TRUE, sucesss; FALSE, fail;
 * Others : 
*******************************************************************************/
unsigned char Socket_1_UDP(SOCKET s)
{
	OS_ERR  err;
	/* set W5500 working as UDP mode */
	Write_1_W5500_SOCK_1Byte(s,Sn_MR,MR_UDP);
	/* open socket */
	Write_1_W5500_SOCK_1Byte(s,Sn_CR,OPEN);
	OSTimeDlyHMSM(0u, 0u, 0u, 5u,
					OS_OPT_TIME_HMSM_STRICT,
					&err);
	if(Read_1_W5500_SOCK_1Byte(s,Sn_SR)!=SOCK_UDP)
	{
		/* socket open failed, close socket port */
		Write_1_W5500_SOCK_1Byte(s,Sn_CR,CLOSE);
		return FALSE;
	}
	else
	{
		return TRUE;
	}
	/* in UDP mode, no need of connection before send data */
	/* in UDP mode, set IP addr and socket port before send data is ok */
	/* you can set you desitnation IP and socket port here if they are fixed */
}
/*******************************************************************************
 * Funtion : W5500_Interrupt_Process
 * Description : ;
 * Input : None
 * Output : None
 * Return : None
 * Others : None
*******************************************************************************/
void W5500_1_Interrupt_Process(void)
{
	unsigned char i,j;
IntDispose:
	/* clear interruption flag*/
	W5500_1_Interrupt=0;
	/* get intertuption registor */
	i = Read_1_W5500_1Byte(IR);
	/* clear interruption registor */
	Write_1_W5500_1Byte(IR, (i&0xf0));
	if((i & CONFLICT) == CONFLICT)//IP��ַ��ͻ�쳣����
	{
		 //�Լ����Ӵ���
	}
	if((i & UNREACH) == UNREACH)//UDPģʽ�µ�ַ�޷������쳣����
	{
		//�Լ����Ӵ���
	}
	i=Read_1_W5500_1Byte(SIR);//��ȡ�˿��жϱ�־�Ĵ���	
	if((i & S0_INT) == S0_INT)//Socket0�¼����� 
	{
		j=Read_1_W5500_SOCK_1Byte(0,Sn_IR);//��ȡSocket0�жϱ�־�Ĵ���
		Write_1_W5500_SOCK_1Byte(0,Sn_IR,j);
		if(j&IR_CON)//��TCPģʽ��,Socket0�ɹ����� 
		{
			S0_1_State|=S_CONN;//��������״̬0x02,�˿�������ӣ�����������������?
		}
		if(j&IR_DISCON)//��TCPģʽ��Socket�Ͽ����Ӵ���
		{
			Write_1_W5500_SOCK_1Byte(0,Sn_CR,CLOSE);//�رն˿�,�ȴ����´����� 
			Socket_1_Init(0);		//ָ��Socket(0~7)��ʼ��,��ʼ���˿�0
			S0_1_State=0;//��������״̬0x00,�˿�����ʧ��
		}
		if(j&IR_SEND_OK)//Socket0���ݷ������?�����ٴ�����S_tx_process()������������ 
		{
			S0_1_Data|=S_TRANSMITOK;//�˿ڷ���һ�����ݰ����?
		}
		if(j&IR_RECV)//Socket���յ�����,��������S_rx_process()���� 
		{
			S0_1_Data|=S_RECEIVE;//�˿ڽ��յ�һ�����ݰ�
		}
		if(j&IR_TIMEOUT)//Socket���ӻ����ݴ��䳬ʱ���� 
		{
			Write_1_W5500_SOCK_1Byte(0,Sn_CR,CLOSE);// �رն˿�,�ȴ����´����� 
			S0_1_State=0;//��������״̬0x00,�˿�����ʧ��
		}
	}
	if(Read_1_W5500_1Byte(SIR) != 0) 
		goto IntDispose;
}
/*******************************************************************************
* ������  : Process_Socket_Data
* ����    : W5500���ղ����ͽ��յ�������
* ����    : s:�˿ں�
* ���?   : ��
* ����ֵ  : ��
* ˵��    : �������ȵ���S_rx_process()��W5500�Ķ˿ڽ������ݻ�������ȡ����,
*			Ȼ�󽫶�ȡ�����ݴ�Rx_Buffer������Temp_Buffer���������д�����
*			������ϣ������ݴ�Temp_Buffer������Tx_1_Buffer������������S_tx_process()
*			�������ݡ�
*******************************************************************************/
void Process_1_Socket_Data(SOCKET s)
{
	unsigned short size;
	size=Read_1_SOCK_Data_Buffer(s, Rx_1_Buffer);
	memcpy(Tx_1_Buffer, Rx_1_Buffer, size);			
	Write_1_SOCK_Data_Buffer(s, Tx_1_Buffer, size);
}

/*******************************************************************************
* ������  : Write_SOCK_Data_Buffer
* ����    : ������д��W5500�����ݷ��ͻ�����
* ����    : s:�˿ں�,*dat_ptr:���ݱ��滺����ָ��,size:��д�����ݵĳ���
* ���?   : ��
* ����ֵ  : ��
* ˵��    : ��
*******************************************************************************/
void Write_1_SOCK_Data_Buffer(SOCKET s, unsigned char *dat_ptr, unsigned short size)
{
	unsigned short offset,offset1;
	unsigned short i;

