alvin233/F407_uCOSIII_191021/Examples/ST/STM32F407VET6/OS3/computerw5500.c
	//�����UDPģʽ,�����ڴ�����Ŀ��������IP�Ͷ˿ں�
	if((Read_1_W5500_SOCK_1Byte(s,Sn_MR)&0x0f) != SOCK_UDP)//���Socket��ʧ��
	{		
		Write_1_W5500_SOCK_4Byte(s, Sn_DIPR, UDP_1_DIPR);//����Ŀ������IP  		
		Write_1_W5500_SOCK_2Byte(s, Sn_DPORTR, UDP_1_DPORT[0]*256+UDP_1_DPORT[1]);//����Ŀ�������˿ں�				
	}

	offset=Read_1_W5500_SOCK_2Byte(s,Sn_TX_WR);
	offset1=offset;
	offset&=(S_TX_SIZE-1);//����ʵ�ʵ�������ַ

	GPIO_ResetBits(W5500_1_SCS_PORT, W5500_1_SCS_Pin);//��W5500��SCSΪ�͵�ƽ

	SPI1_Send_Short(offset);//д16λ��ַ
	SPI1_Send_Byte(VDM|RWB_WRITE|(s*0x20+0x10));//д�����ֽ�,N���ֽ����ݳ���,д����,ѡ��˿�s�ļĴ���

	if((offset+size)<S_TX_SIZE)//�������ַδ����W5500���ͻ������Ĵ���������ַ
	{
		for(i=0;i<size;i++)//ѭ��д��size���ֽ�����
		{
			SPI1_Send_Byte(*dat_ptr++);//д��һ���ֽڵ�����		
		}
	}
	else//�������ַ����W5500���ͻ������Ĵ���������ַ
	{
		offset=S_TX_SIZE-offset;
		for(i=0;i<offset;i++)//ѭ��д��ǰoffset���ֽ�����
		{
			SPI1_Send_Byte(*dat_ptr++);//д��һ���ֽڵ�����
		}
		GPIO_SetBits(W5500_1_SCS_PORT, W5500_1_SCS_Pin); //��W5500��SCSΪ�ߵ�ƽ

		GPIO_ResetBits(W5500_1_SCS_PORT, W5500_1_SCS_Pin);//��W5500��SCSΪ�͵�ƽ

		SPI1_Send_Short(0x00);//д16λ��ַ
		SPI1_Send_Byte(VDM|RWB_WRITE|(s*0x20+0x10));//д�����ֽ�,N���ֽ����ݳ���,д����,ѡ��˿�s�ļĴ���

		for(;i<size;i++)//ѭ��д��size-offset���ֽ�����
		{
			SPI1_Send_Byte(*dat_ptr++);//д��һ���ֽڵ�����
		}
	}
	GPIO_SetBits(W5500_1_SCS_PORT, W5500_1_SCS_Pin); //��W5500��SCSΪ�ߵ�ƽ

	offset1+=size;//����ʵ��������ַ,���´�д���������ݵ��������ݻ���������ʼ��ַ
	Write_1_W5500_SOCK_2Byte(s, Sn_TX_WR, offset1);
	Write_1_W5500_SOCK_1Byte(s, Sn_CR, SEND);//����������������				
}
/*******************************************************************************
* ������  : Read_W5500_SOCK_2Byte
* ����    : ��W5500ָ���˿ڼĴ�����2���ֽ�����
* ����    : s:�˿ں�,reg:16λ�Ĵ�����ַ
* ���?   : ��
* ����ֵ  : ��ȡ���Ĵ�����2���ֽ�����(16λ)
* ˵��    : ��
*******************************************************************************/
unsigned short Read_1_W5500_SOCK_2Byte(SOCKET s, unsigned short reg)
{
	unsigned short i;

	GPIO_ResetBits(W5500_1_SCS_PORT, W5500_1_SCS_Pin);//��W5500��SCSΪ�͵�ƽ
			
	SPI1_Send_Short(reg);//ͨ��SPI1д16λ�Ĵ�����ַ
	SPI1_Send_Byte(FDM2|RWB_READ|(s*0x20+0x08));//ͨ��SPI1д�����ֽ�,2���ֽ����ݳ���,������,ѡ��˿�s�ļĴ���

	i=SPI_I2S_ReceiveData(SPI_1_SEL);
	SPI1_Send_Byte(0x00);//����һ��������
	i=SPI_I2S_ReceiveData(SPI_1_SEL);//��ȡ��λ����
	SPI1_Send_Byte(0x00);//����һ��������
	i*=256;
	i+=SPI_I2S_ReceiveData(SPI_1_SEL);//��ȡ��λ����

	GPIO_SetBits(W5500_1_SCS_PORT, W5500_1_SCS_Pin);//��W5500��SCSΪ�ߵ�ƽ
	return i;//���ض�ȡ���ļĴ�������
}

/*******************************************************************************
* ������  : Read_SOCK_Data_Buffer
* ����    : ��W5500�������ݻ������ж�ȡ����
* ����    : s:�˿ں�,*dat_ptr:���ݱ��滺����ָ��
* ���?   : ��
* ����ֵ  : ��ȡ�������ݳ���,rx_size���ֽ�
* ˵��    : ��
*******************************************************************************/
unsigned short Read_1_SOCK_Data_Buffer(SOCKET s, unsigned char *dat_ptr)
{
	unsigned short rx_size;
	unsigned short offset, offset1;
	unsigned short i;
	unsigned char j;

	rx_size=Read_1_W5500_SOCK_2Byte(s,Sn_RX_RSR);
	if(rx_size==0) return 0;//û���յ������򷵻�
	if(rx_size>1460) rx_size=1460;

	offset=Read_1_W5500_SOCK_2Byte(s,Sn_RX_RD);
	offset1=offset;
	offset&=(S_RX_SIZE-1);//����ʵ�ʵ�������ַ

	GPIO_ResetBits(W5500_1_SCS_PORT, W5500_1_SCS_Pin);//��W5500��SCSΪ�͵�ƽ

	SPI1_Send_Short(offset);//д16λ��ַ
	SPI1_Send_Byte(VDM|RWB_READ|(s*0x20+0x18));//д�����ֽ�,N���ֽ����ݳ���,������,ѡ��˿�s�ļĴ���
	j=SPI_I2S_ReceiveData(SPI_1_SEL);
	
	if((offset+rx_size)<S_RX_SIZE)//�������ַδ����W5500���ջ������Ĵ���������ַ
	{
		for(i=0;i<rx_size;i++)//ѭ����ȡrx_size���ֽ�����
		{
			SPI1_Send_Byte(0x00);//����һ��������
			j=SPI_I2S_ReceiveData(SPI_1_SEL);//��ȡ1���ֽ�����
			*dat_ptr=j;//����ȡ�������ݱ��浽���ݱ��滺����
			dat_ptr++;//���ݱ��滺����ָ���ַ����?
		}
	}
	else//�������ַ����W5500���ջ������Ĵ���������ַ
	{
		offset=S_RX_SIZE-offset;
		for(i=0;i<offset;i++)//ѭ����ȡ��ǰoffset���ֽ�����
		{
			SPI1_Send_Byte(0x00);//����һ��������
			j=SPI_I2S_ReceiveData(SPI_1_SEL);//��ȡ1���ֽ�����
			*dat_ptr=j;//����ȡ�������ݱ��浽���ݱ��滺����
			dat_ptr++;//���ݱ��滺����ָ���ַ����?
		}
		GPIO_SetBits(W5500_1_SCS_PORT, W5500_1_SCS_Pin); //��W5500��SCSΪ�ߵ�ƽ

		GPIO_ResetBits(W5500_1_SCS_PORT, W5500_1_SCS_Pin);//��W5500��SCSΪ�͵�ƽ

		SPI1_Send_Short(0x00);//д16λ��ַ
		SPI1_Send_Byte(VDM|RWB_READ|(s*0x20+0x18));//д�����ֽ�,N���ֽ����ݳ���,������,ѡ��˿�s�ļĴ���
		j=SPI_I2S_ReceiveData(SPI_1_SEL);

		for(;i<rx_size;i++)//ѭ����ȡ��rx_size-offset���ֽ�����
		{
			SPI1_Send_Byte(0x00);//����һ��������
			j=SPI_I2S_ReceiveData(SPI_1_SEL);//��ȡ1���ֽ�����
			*dat_ptr=j;//����ȡ�������ݱ��浽���ݱ��滺����
			dat_ptr++;//���ݱ��滺����ָ���ַ����?
		}
	}
	GPIO_SetBits(W5500_1_SCS_PORT, W5500_1_SCS_Pin); //��W5500��SCSΪ�ߵ�ƽ

	offset1+=rx_size;//����ʵ��������ַ,���´ζ�ȡ���յ������ݵ���ʼ��ַ
	Write_1_W5500_SOCK_2Byte(s, Sn_RX_RD, offset1);
	Write_1_W5500_SOCK_1Byte(s, Sn_CR, RECV);//����������������
	return rx_size;//���ؽ��յ����ݵĳ���
}
void W5500_1_Initial(void)
{
  OS_ERR  err;
/* SPI configuration */
  SPI_1_Configuration();	
  /* GPIO Init */
  W5500_1_GPIO_Configuration();
  /* Setting Net Parameter */
  Load_1_Net_Parameters();
  /* Reset */
  while(!W5500_1_Hardware_Reset())
    {
    /* trap CPU here while W5500 hardware reset wrong */
    OSTimeDlyHMSM(0u, 0u, 2u, 100u,
      OS_OPT_TIME_HMSM_STRICT,
      &err);
    }
	/* W5500 hardware reset OK */
  W5500_1_Initialization();	
}



